[
    { 
        "title":"互動式程式設計學習平台", 
        "partner":["陳怡君", "許瑋芩", "何彥儒", "宋承翰", "黃豊凱"], 
        "year":"2018", 
        "introduction":"　　在這個資訊蓬勃的時代中，生活上無不缺少與資訊科技相關的事物，人們日常所接觸到的食衣住行育樂，也都包含了各式各樣的資訊技術，由此可見，資訊是生活中不可或缺的一環，根據iThome統計，臺灣在2016年，超過3成的企業要增加資訊人員，並且企業在IT的預算，比起2015年則是增加了10.8%，傳統製造產業也因資訊科技的衝擊，所以須面臨組織的轉型，因此資訊需求只會有增無減。\n\n　　培養一個資訊人員不外乎是從學校開始，在臺灣從高職、大專院校或是大學皆有設置資訊相關係所，在坊間也不乏資訊類補習班，而學習資訊的基礎便是程式設計，但許多初學者往往在學習基礎街段時，便因為無法理解程式邏輯、找不到程式錯誤解決方法或是跟不上學習進度，而讓其對自身的程式學習能力感到不安，進而讓初學者放棄繼續學習的動力，這種情況讓許多畢業於資訊相關科系的學生，出社會後因程度不足，找不到適合的工作，反而從事非資訊相關的工作，造成在學期間，浪費時間以及資源的情況。\n\n　　本研究期望運用開發的互動式程式語言學習網站，設計一套系統可以讓程式初學者，以循序漸進的方式學習，當學習途中遇到問題或是瓶頸時，提供適當的解決方法，當初學者學習新知識後，立即給予新知識的強化，讓初學者逐漸習得，加深知識印象，進而將學習到的知識存入長期記憶，並以互動式的程式學習，激發初學者的學習動機，並開發其潛在能力，同時搭配視覺化的網頁，以及遊戲方式的設計，來呈現整個學習網站，讓初學者保持學習的興趣，而後成功的完成學習進度，可以增強初學者的自我效能，增加其自信心，對學習程式不再恐懼。\n\n　　基於上述，本研究將透過互動式程式語言學習平台，結合學習理論，以學生為對象，搭配JavaScript程式語言，不同於傳統的書本教學，透過本系統的教學設計，吸引學生使用，增加其對學習程式語言的信心，進而加強其對學習程式的興趣，且在學習的過程中，縮短學習程式的碰撞期，並找到自信心。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-1.png"
    },
    { 
        "title":"學無止徑", 
        "partner":["黃煒凱", "陳俊豪", "黎卋軒", "黃俊霖", "游騰昕"], 
        "year":"2018", 
        "introduction":"　　隨著二十一世紀來臨，許多新興科技開始快速發展，從民國八十年IBM最早提出的個人電腦，到九十年的Laptop，逐漸發展到民國一百年的智慧型手機裝置，在技術成長同時，人工智慧、大數據以及物聯網的概念被許多學者推出，更將成為未來的科技發展主流。\n\n　　根據天下雜誌報導及相關新聞顯示，現今資訊市場明顯缺乏工程師，未來資訊科技將成為教育主流，程式語言發展成為全球趨勢。近幾年開始，從以往人與人之間的對話，到現今著重思考與機器對話的軟體思維，而人工智慧正是現在的走向，這近三十年來的科技皆脫離不了程式語言的基礎，將來資訊相關發展必定建立於程式語言之根基上，培育資訊人才已成為全球發展重點項目之一。\n\n　　資訊時代的來臨，「資訊工程師」已逐漸成為市場缺乏的人力需求，許多學生想學習程式語言，卻又無法找到實際的學習方式，在學課程多指向理論概念，缺少專案系統的編程實作，且程式語言又再分為前端、後端、資料庫等，每塊亦有不同的語法，使得剛接觸程式設計的學生不知該從何處開始著手學習。社會上亦有看見趨勢之人民，卻無程式語言相關基礎，而市面上的資訊書籍多為理論導向教學，普遍無法實戰於工作之中，使得有程式設計學習需求的人們，無法得知自身學習狀況與缺乏學習資源，以致於實力無法有效提升。\n\n　　有鑑於許多社會新鮮人進入職場之資訊相關人才，因為自身程式程度不足以達成企業所需，導致挫敗感加重；或是對於各項程式語言的專精程度不同，而無法有效發揮自身擅長之事物，達不到「物盡其用，人盡其才」之成效；抑或是對於職場定位不明確，無法找到自身感興趣之職業定位，而對未來發展方向感到徬徨無助，綜合上述原因，讓許多新鮮人可能對於是否選擇此出路而感到猶豫。本系統希望利用多項功能，藉由性向測驗及問卷測驗等，找出自身較感興趣之發展方向，並輔助學習者打好程式設計基礎。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-2.png"
    },
    { 
        "title":"砍掉重鏈", 
        "partner":["黃子銘", "蔡佩君", "林君憶", "吳柏進", "楊鎧睿"], 
        "year":"2018", 
        "introduction":"　　近年來在區塊鏈的蓬勃發展下，不少以區塊鏈為基礎的應用油然而生。許多企業看準區塊鏈的特性與優勢，紛紛投入區塊鏈的研究和開發，以充分顯示區塊鏈技術已成為資訊科技的重要發展項目。區塊鏈主要特性為去中心化與資料的不可竄改性，其參與區塊鏈網路節點都依照著共識機制寫入鏈上，並且在寫入後與所節點進行同步，以達到去中心化與資料不可竄改性，而現今普遍應用在金融業、保險業等。\n\n　　由於網際網路的快速發展下，網路平台竄升速度直線飆升，物流業所扮演的角色越來越重要，但其供應鏈過於繁複冗長，經常發生丟包爆倉的情形、客戶資料的外洩、消費者錯領誤領等狀況發生，導致其效益不佳。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-3.png"
    },
    { 
        "title":"肌肉萎縮評估與延緩之研究", 
        "partner":["邱仲亭", "林政穎", "吳若慈", "張孝睿", "林怡君", "徐軒輔"], 
        "year":"2018", 
        "introduction":"　　肌肉萎縮易發生於受傷或大病過後，由於身體活動量大幅下降，導致廢用性肌肉萎縮的發生，因此醫生便會要求患者進行復健。復健是一種循序漸進的治療方式，由於復健治療常需持續較長時間，因此在每次復健的過程中，患者不易感受其是否有成效，無法清楚掌握自身恢復狀況。在復健初期，患者因身體機能下降，原本可輕鬆做到的行為，例如：行走、起立的動作，需花費更大的力氣才能做到生病前的標準，容易讓患者產生挫折感。\n\n　　現代醫學科技發展上，為了讓患者在復健治療中能有更好的恢復效果，發明了許多的輔助科技（Assistive Technology），例如：生物回饋訊號（Bio-feedback）等科技與復健結合的應用。能夠擷取人體訊號並將之數據化，作為生理判斷指標，幫助醫師與病患能更輕易的了解身體狀況。\n\n　　根據過去多數文獻資料，目前幾乎沒有將生物回饋訊號技術結合行動應用程式（APP）的產品出現，如果能使兩者相互結合，讓肌肉萎縮患者能在任何情況下自我檢測，相信能為這類患者帶來更大的幫助。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-4.png"
    },
    { 
        "title":"幸福IN居", 
        "partner":["董子瑜", "蔡侑倫"], 
        "year":"2018", 
        "introduction":"　　在這個經濟快速發展的時代，現代人越來越注重生活品質，許多年輕族群在考慮居住地點時，會考慮到許多環境及經濟安全等問題。首先是環境相關問題，例如：該地區的紫外線是否過高，是否會造成皮膚或眼睛的傷害；或是空氣中的細懸浮微粒（PM2.5）是否超標，影響到人體呼吸道的危害；亦或居住地附近水質是否在平均值內，能否正常飲用。其次是經濟相關問題，像是生活周遭的交通是否便捷、商家的數目多寡，及對於人身財產和居家安全的顧慮等，然而目前市面上能檢視這些相關數據之系統較為缺乏，也無一套整合式系統可以分析各層面生活居住相關的數據，若能將居住環境周圍的資料量化成有意義的資訊，並分析出結果，讓使用者隨時觀看。勢必能讓民眾更了解自己的居住環境，進而提升生活居住品質。\n\n　　因此本系統採用政府開放資料系統中的OpenData，包括經濟面向：生活便利性與安全性，環境面向：陽光、空氣、水，並結合Google地圖API，開發出一套數據分析系統，提供全臺分布圖供使用者觀看，並以五大評估指標包括：環境指標、安全指標、交通指標、教育指標與便利指標，計算出該地區之幸福指數，欲達成環境狀態檢測、施政方向之參考、移居人口提升之三點目的。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-5.png"
    },
    { 
        "title":"Codio—雲端程式碼編輯協作平台", 
        "partner":["許歆荷", "王敬夫", "江穎旻", "賴育晨", "劉容安"], 
        "year":"2019", 
        "introduction":"　　科技的趨勢與演進為產業帶來了翻天覆地的革命，同時也帶動IT人力的需求變革，隨著雲端運算、行動應用、大數據、人工智慧、物聯網等技術蓬勃發展，人才已經成為企業競爭力的一大關鍵，而這其中，資訊科技相關的人力更是求才若渴。根據104人力銀行統計，2018年「5大資料經濟職務需求趨勢」之數據顯示，其中軟體工程師佔很高的比例，缺口竟高達三萬一千個工作數，相較2014 年需求成長58%，而我們亦發現愈來愈多人為因應此趨勢，試圖涉足資訊產業，導致諸多程式開發與學習者的出現。\n\n　　然而，若選擇自行學習程式語言，初學者不外乎會碰到的困境為因學習一個全新的程式語言、熟悉一個全新的開發環境（整合開發環境，IDE），並且與陌生團隊合作，使得眾多開發者於學習過程，喪失信心、迷失方向，陷入永無止境的掙扎與困境中，甚至放棄了成為軟體工程師的目標。而本團隊經過多次研究與討論後，整合現今市場上的線上程式碼編輯平台之優點，期望打造一座雲端程式碼編輯平台，目前先行提供網頁前端HTML、CSS、JavaScript等程式語言，專案開發除了基本的新增、修改等功能之外，使用者得以對專案作品進行評價、分享與收藏，獲得他人肯定與認同價值，並從與他人討論、交流的互動過程中，彼此相互獲得回饋。\n\n　　其中本平台針對團隊合作，制定「即時共同編輯專案」功能，解決開發者長期以來多人開發專案上不便之痛點，亦可讓初學者學習他人的專案程式寫法，作為自身撰寫程式碼的經驗累積；於淬取精華後，重新加以梳理之後整理成冊，做為技能傳承以及後進者的操作指引，並且減少學習和教育訓練的時間；於團隊作業或是企業經營，則為提升往後團隊協同效率。最重要的是透過Codio雲端編輯平台的知識管理與保存以及交流、互動的環境中，提升「知識」分享，進而激發創新行為的產生。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-6.png"
    }, 
    { 
        "title":"紅粉知己Find Your Foundation", 
        "partner":["兵珮瑄", "陳璟誼", "呂欣盈", "林庭蓁"], 
        "year":"2019", 
        "introduction":"　　化妝品產業的蓬勃發展，讓使用者在選購時有更多元的選擇，本團隊深入了解使用者對化妝品的需求並實作出「紅粉知己Find Your Foundation」，而本系統貢獻如下：\n\n　　膚色辨識粉底液推薦：透過基於Python語言使用Open CV並搭配dlib Machine learning函式庫實作膚色影像辨識檢測，進而推薦適合的粉底液產品，讓使用者無需浪費挑選色號的選擇成本。\n\n　　貨比不只三家：採用 Python 語言實作網路爬蟲技術進行網頁數據抓取，分析各大網路商城同項產品價格比價，立即找出最便宜的商品供使用者選擇。\n\n　　多元數據統計：透過使用者膚色檢測紀錄、購買歷史紀錄等數據追蹤，進而統計出大眾熱銷產品與個人消費習慣資訊。　　\n\n個人化行銷：根據使用者購買紀錄，分析出使用者平均購買乙次的頻率，在其下次購買時間接近時，系統將主動寄送優惠券，達到顧客忠誠度的目的。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-6.png"
    },
    { 
        "title":"POS witch-雲端POS系統", 
        "partner":["陳柏杰", "劉仁恩", "林家安", "周冠瑜", "陳昱廷"], 
        "year":"2019", 
        "introduction":"　　此次專題以產學合作方式與「元弘資訊系統有限公司」合作，開發POS系統，並且將傳統的POS系統進行雲端化，使系統可以「跨平台」、「跨裝置」、「跨螢幕」。本系統貢獻如下：\n\n　　跨平台、跨裝置、跨螢幕：透過將POS系統雲端化，並且使用RWD響應式設計，再加上使用微軟最新的跨平台後端框架Dotnet Core進行後端開發，使得POSwitch只需要網路與能使用瀏覽器的設備即可使用，避免出現硬體設備與作業系統不同的平台限制。\n\n　　良好的資料庫設計：為了解決不同店家餐點規格不同的問題，我們透過第三正規化的資料庫設計，降低餐點各個不同欄位的相依性，使用多種欄位來組合一項餐點，藉此面對不同店家時，只需要關閉不需要的欄位，即可快速轉換，快速滿足店家需求。\n\n　　數據分析技術：我們使用數據分析技術，統計餐點的銷售數據，同時製作視覺化圖表，藉此可以提供店家相關的銷售決策依據。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-6.png"
    },
    { 
        "title":"精準落地", 
        "partner":["楊鎧睿", "黃煒凱", "黃子銘"], 
        "year":"2019", 
        "introduction":"　　隨著資訊科技的快速進步，使用資訊科技來輔助企業進行銷售手段與行銷決策的情形越來越普及。然而，企業追求的目標，往往不只有讓消費者接受行銷訊息這麼簡單，企業是以營利為最終目的，由於成本的考量，所以企業追求的最終目標，是讓行銷所花費的費用分毫不會浪費，這意味著必須「在對的時間以對的方式還有對的價格推銷給對的人」，這才是企業要的行銷手段。\n\n　　為了要達到「命中率」為100%的行銷手段，近幾年來，「精準行銷」是一個很熱門的討論話題，那麼何謂「精準行銷」呢？「行銷」意味著每送出的一張張宣傳DM或是每則廣告，象徵著戰場上的每一支的箭，箭並不是取之不盡，用之不竭，在成本有限的情況下，每支箭都極為珍貴；而「精準」意味著每支發出去的箭，必須都要箭無虛發，並且除了箭無虛發之外，更箭箭都要直接命中要害，讓敵人一箭斃命。\n\n　　現今台灣社會上，其行銷手段大多為「預測性行銷」，例如：中秋節快到了，在一個月前就開始促銷烤肉用品或月餅等等。市場上，較少店家能夠真真正正的做到「精準行銷」，其原因為台灣人還是依賴現金支付為主，若行動支付普及了，在結帳時，店家也能知道這筆訂單是哪隻手機號碼買的，就可以進而去研究消費者行為。\n\n　　本系統是與國興資訊以及楓康超市進行產學合作，在楓康超市中，原有的會員消費額就佔了超市營收的70~80%，由此可以看出，楓康超市的會員是有較高的消費忠誠度，因此楓康超市認為在忠誠度這麼高的狀況底下，去分析消費者行為是有意義的且對於楓康超市也會有極大的幫助，讓楓康超市能夠推動精準行銷。\n\n　　綜合上述動機，本團隊結合AI演算法，K-means以及臉部辨識，與關聯法則，並且針對楓康超市青海店與中科店提供的2019年上半年度的銷售資料，開發出一個專屬於楓康超市的「精準落地」銷售資訊平台，必且希望藉由此平台的資訊衍生出許多行銷方案，例如：流程為在會員結帳時，透過臉部辨識查詢出該會員的購買紀錄，以及他會喜歡購買的商品組合，在結帳時，服務員順口問一下會員需不需要一起帶他喜歡的商品一起走，只要有一個願意購買，就可以提升銷售額。希望透過本平台所提供的資訊，諸如：營收分析、戰情室、客群分析與商品分析等等，讓超市在發展行銷策略時，有一個客觀的數據，作為決策的依據。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-6.png"
    },
    { 
        "title":"房事求一個圓", 
        "partner":["吳玟憲", "廖麗詩", "許巧諮", "張晶郁"], 
        "year":"2019", 
        "introduction":"　　隨著時代進步，現代人越來越關心周遭的生活居住品質，但有此資訊需求的人常因資料繁雜而對自己的居住環境一知半解，加上現在多媒體盛行，資訊取得容易，很多像是新聞或者報紙時常炒作報導內容，導致資訊不正確的情形越來越嚴重，進而讓民眾對生活居住品質的理解越來越模糊。\n\n　　因此本系統採用經濟部的主題式開放資料與政府開放資料系統中兩種面向之OpenData，包括經濟面向：生活便利性與安全性，環境面向：陽光、空氣、水，並結合Google地圖API，開發出一套數據分析系統，提供全臺分布圖供使用者觀看，並以五大評估指標（數）包括：紫外線指數、空氣指標、水質指標、便利性指數與安全性指數，計算出該地區之幸福指數，欲達成以下三點目的：\n\n　　1.環境狀態檢測：透過環境數據可以讓使用者提前清楚目前環境狀態，進行預防，例如紫外線過高可能需要戴太陽眼鏡、擦防曬乳液、穿長袖衣物，而空污過高需要戴口罩、避免外出等。\n\n　　2.施政方向之參考：此系統將各數據整合後進行分析，能更明確的判斷出該地區的生活品質，亦可作為政府未來施政方向之參考。\n\n　　3.移居人口提升該：地區的幸福指數越高，證明生活品質越高，可藉由幸福指數作為購屋之依據，促進當地買房景氣，同時提升該地區之人口數。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-6.png"
    },
    { 
        "title":"Rementia", 
        "partner":["莊勝傑", "倪學菁", "陳立蓉", "蔡宇傑", "黃晏綾"], 
        "year":"2020", 
        "introduction":"　　隨著資訊科技的進步與競爭環境快速變化，人們需要面臨挑戰、處理問題與工作內容的複雜度與變動性都持續地提高，而認知能力是人類處理問題的基礎，是面對日常生活、工作與學習時的必要資源，在認知能力中，記憶力對於訊息處理、解讀、反應與學習具有重要的影響。記憶力分為短期記憶與長期記憶，短期記憶是用來暫時儲存解決問題相關的概念與事實，其中的工作記憶(working memory)是一種由資訊暫存、處理和運作組成的交互過程模式，可協助個體對資訊進一步的處理與運用，以面對所需要解決的問題、任務或需學習的知識(Martinussen & Tannock, 2006)。長期記憶則將接收的資訊保存，並形成長期不忘的永久記憶。\n\n　　本系統係設計記憶力訓練遊戲(APP)，及web上面所填寫的個人生活習慣問卷，監測高齡者遊戲分數變化、及腦波特徵變化，傳輸到雲端資料庫進行檢測與分析，並在web網頁上瀏覽各項圖表，達到及早評估與治療的效果，也將遊戲式訓練方法融入老人的生活娛樂中，降低記憶力衰退的機率，並提升高齡者的生活品質。\n\n　　主要為探討遊戲式記憶訓練方法對高齡者在短期記憶、工作記憶及長期記憶的影響，針對短期、工作與長期的遊戲式記憶力訓練方法，(1)結合N-back任務的懷舊歌曲遊戲(歌詞填空)(2)結合位置記憶法的空間方塊遊戲(配對翻牌)，(3)結合聯想法的照片回憶式遊戲(圖像記憶)。以高齡者為研究對象，進行實驗設計研究，以了解記憶力訓練的成效。\n\n　　透過Web的分析達到警示的效果，如果能在發病之前的潛伏期段就察覺老年人在工作記憶能力上的個別差異，將能提早幫助工作記憶能力不佳的老人，運用輔導策略，重複重要訊息，降低工作記憶負荷量，協助老人在適應瞬息萬變的現今社會，適應新時代生活的路上走得更為順遂。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-7.png"
    }, 
    { 
        "title":"HI-MIND精神壓力與照護系統", 
        "partner":["林郁翔", "呂易蓁", "呂哲嶙", "謝瑜庭", "陳萱"], 
        "year":"2020", 
        "introduction":"　　伴隨著資訊科技快速發展，現今生活環境便利，科技快速躍進，相對也帶來了龐大壓力，忙碌生活、交際應酬、以及網路成癮等等，使得人們休息時間越來越少，壓力也成為生活中的一部分。適度的壓力，可有助於刺激潛能，提升個人成長表現，但當周遭的環境壓力，超過個體所能負荷時，該個體就有可能產生「精神疾病」。當個體無法負荷過大的精神壓力時，就容易產生憂鬱症、躁鬱症、精神分裂等精神疾病，更可能伴隨著心血管疾病等慢性疾病的問題，因此學會適度的釋放壓力，才能夠擁有健康的身心。\n\n　　現代人生活步調快速，對於自身健康較無暇管理，若到醫療機構進行精神壓力的檢測，程序繁雜且耗時，因而時常忽略身體發出的警訊，因此個人醫療照護系統日漸受到重視。透過穿戴式裝置與行動載具的結合，將精神壓力的資訊放置行動載具應用程式(Application, APP)中，使用者就能透過行動載具得知自己的精神壓力狀況，並針對精神壓力的程度改善其身心狀況。為避免患者長期處於高度壓力環境下而不自知，導致精神及慢性疾病的產生，此應用程式具有即時評估壓力狀態的功能，當壓力超出所預設的值就發出警訊，幫助使用者提高警覺，降低罹患精神、心血管等疾病的風險。\n\n　　本文將探討如何利用行動載具之應用程式，來檢測受測者目前的精神狀態，並且提出警示訊息以及給予有效的建議。受測者將帶上具有檢測心跳、睡眠等的穿戴式偵測裝置，藉由藍芽技術將受測者的生理參數資訊傳輸到行動載具的應用程式中，診斷受測者的精神壓力程度，並根據壓力程度不同，給予適當的舒壓建議。當受測者的生理參數超出所設定的標準，行動載具會出現警示訊息，提醒受測者須提高警覺並給予紓壓建議，應用程式會記錄生理參數的資訊，並根據壓力評估數據對受測者進行有效的建議。\n\n　　基於上述，預計本研究將透過穿戴式裝置結合深度學習以及行動應用程式(APP)的行動照護，將能在精神壓力過大時，即時提醒並給予適當的紓壓建議，避免精神與慢性疾病的產生。快速方便的精神壓力狀態提醒、顯示與比較功能將協助使用者了解與管理自身的精神壓力狀態，這樣的創新將可能帶來行動醫療照護的商機。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-7.png"
    }, 
    { 
        "title":"CodeWork 學以致用", 
        "partner":["許孟蘋", "陳威志", "翁權志", "許智凱"], 
        "year":"2020", 
        "introduction":"　　根據商業周刊以及相關報導指出，近年來各領域之大型企業紛紛投入資訊產業，104求職網以及經濟部工業司人才需求調查開放資料的數據顯示，目前市場需求的資訊職務占了七成，而後疫情時代使民眾的消費型態從線下轉到線上，於此同時資訊人才的需求量也在急速上升。\n\n　　在現今分秒必爭的時代，企業挑選人才僅透過履歷以及三到五分鐘的面試對求職者進行初步理解以及錄用抉擇，到職後必須透過試用期、試作才能真正了解員工的特質是否符合企業文化以及在工作上是否適任，不僅花時間，也耗費不少資本；另外企業在尋找高階人才時，往往需要透過獵頭公司才能找到自己需要的人才，也沒辦法即時地與其進行溝通，導致該人才是否為該企業所迫切需要也無法有一個重要的參考依據。\n\n　　本團隊期望打造一個資訊職務的求職媒合平台，解決以往傳統求職網站的不便之處，並利用企業與求職者兩者的特色與相符程度藉由Text Mining分析達到智能媒合，減少所花費的時間與資本；媒合成功後，雙方透過WebSocket所建立的媒合聊天室進行即時溝通以及利用Webcam遠端面試；再利用評分功能於平台上顯示出履歷以外更加透明公正的資訊作為參考，平衡雙方之間的資訊，最終讓求職者與企業都能在有效的資源及成本內找尋適切的對象。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-7.png"
    }, 
    { 
        "title":"Eye Opener-不良用眼行為警示系統", 
        "partner":["陳建成", "林承冠", "歐俞均", "蘇煜仁"], 
        "year":"2020", 
        "introduction":"　　台灣社會兒童近視比例逐年增高，尤其是在國小階段，因此「Eye Opener-不良用眼行為警示系統」架設網路攝影機擷取不同用眼行為，再透過無線網路傳輸到雲端平台，並導入卷積神經網路(Convolutional neural network, CNN)建立影像識別模型，進而取得視距、視角、坐姿與用眼時間等特徵，再結合光線感測裝置取得 環境光線，作為評估用眼行為不良的判斷變數，訓練一套不良用眼行為之模型，透過適 當的警示與推薦正確用眼行為的提醒，進行用眼行為矯正以降低造成近視的機率。 ", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-7.png"
    }, 
    { 
        "title":"交通事故風險分析平臺", 
        "partner":["周冠瑜", "陳璟誼", "郭啟倫", "林家安"], 
        "year":"2020", 
        "introduction":"　　在科技快速進步的時代中，人們去到目的地的發法從走路慢慢轉變成汽機車代步，乍看之下，雖然生活機能提升，去到任何地方都方便又快速，但也隨之帶來了許多的事故和憾事，例如無照酒駕或者是未依交通號誌導致發生交通事故等等的新聞層出不窮，使得用路人在路上都人心惶惶，安全無法完全的保障。\n\n　　剛好在我們的產學合作中，有跟交通事故分析有關的公司，所以想運用產學方的交通專業知識和龐大的數據資料，結合我們所擁有的分析技術，來找出發生交通事故的特徵及因素，最後將特徵、因素和分析結果交由專家參考並提出交通策略來降低交通事故的發生機率。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-7.png"
    }, 
    { 
        "title":"手影隨行", 
        "partner":["陳奕伶", "王子瑜", "江糖晴", "柯宣竹", "沈舜鴻", "廖偉翔"], 
        "year":"2021", 
        "introduction":"　　根據衛生福利部統計處統計，至2020年臺灣人口有1,198,358人為身心障礙者，其中聽覺機能障礙者、聲音機能障礙者與語言機能障礙者（以下簡稱聽語障者），人數高達140,000人，近十年來，人數更是逐年遞增。換句話說，在臺灣我們生活周遭每168人，就有機會遇到1位聽語障者。\n\n　　聽語障者在與健聽者交談時，多使用手語、口語，或是透過文字的方式來傳遞訊息，其中最直接也最簡單的交談方式是透過文字書寫，但是以文字書寫做為交談的媒介，其實速度遠比手語或口語直接表達還要慢上許多；再者，聽語障者的口語因為聽覺與言語上的障礙，在學習與使用上較為困難，除此之外，通常僅有身邊有家人朋友為聽語障者，有長期交談需求，才會使健聽者主動學習手語，導致「手語」與「會手語的人」在現有社會上不普及；因此，健聽者與聽語障者之間，往往需要透過手語翻譯員的協助，使雙方溝通更順暢。根據我國勞動部統計，近五年考取「手語翻譯丙級技術士」及「手語翻譯乙級技術士」之人數僅有504位，占全臺人口的0.002%，由此可知，聽語障者與手語翻譯員的供需失衡，進而導致聽語障者與外界溝通困難，也產生了語言的隔閡。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-8.png"
    },
    { 
        "title":"搜就快SoShortQueen—室內賣場定位系統", 
        "partner":["李文茜", "李怡婷", "楊承芳", "洪菁嬬", "張湘昀", "鄒卓汶"], 
        "year":"2021", 
        "introduction":"　　近年來消費者到賣場購買生活物資的需求比例增加，使得賣場的數量越來越多。根據Numerator Insights統計，消費者於假日去賣場消費的比例高達36%，在這種人潮高峰期間，再加上消費者常因為賣場過大找不到目標商品，需要四處尋找地圖及店員，花費額外時間解決本不必要出現的問題，而導致購物體驗降低。\n\n　　根據尼爾森2018年消費者購物行為研究報告顯示，「讓人樂在其中的購物經驗」為造訪賣場、超市驅力的第三名，而包含在購物體驗之中的「可以很容易、很快地找到我要的產品」也位居第四，可見好的效率會影響消費者在購物過程中的心情，甚至增加再次造訪此賣場的意願。\n\n　　綜合上述，為了讓消費者能更快速地找到商品，本團隊構想出搜就快So Short Queen－室內賣場定位系統，藉由當今人手一台的手機，拍下距離消費者自身最近的商品，系統透過卷積神經網路(Convolutional Neural Network, CNN)自定義圖像分類，影像辨識出該商品，與賣場商品陳設位置資料庫進行比對，精準定位出消費者的現在位置，並根據消費者輸入欲找尋目標商品，提供以最短路徑快速演算法(Shortest Path Faster Algorithm)計算出的最佳導航路徑，將賣場二維平面圖與路徑規劃呈現於手機中，有效幫助消費者用最短時間準確地找到商品，提升消費者購物體驗之餘，也解決賣場尖峰時間的壅塞問題；此外，本系統提供業者Analytical Dashboard，業者可依據商品品項、分類深入分析，進一步查看年齡與性別分布圖表。量化數據不僅可反映賣場貨架的安排缺失，更得以掌握使用者的消費偏好、作為後續行銷策略之參考。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-8.png"
    },
    { 
        "title":"LAB財標系統", 
        "partner":["劉千滎", "翁權志"], 
        "year":"2021", 
        "introduction":"　　「LAB財標系統」是一套紀錄LAB財產的系統，透過react顯示前端LAB財標系統的相關畫面、node js會紀錄LAB所有的財產資訊和記錄所有LAB財產被借用的同學資訊，來減少每次清點財產花費的時間和避免清點財產時發生對錯財產的問題。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-8.png"
    },
    { 
        "title":"聊療", 
        "partner":["陳俊林", "陳旻愉", "邱冠翔", "林秉宏", "張博叡"], 
        "year":"2022", 
        "introduction":"　　顧客至上、服務第一是現今大大小小的企業所信奉的守則，使的客服愈來愈受到重視，因此將客服系統自動化愈來愈重要，而聊天機器人正是客服自動化的首要選擇，但是在建構客服聊天機器人之前，多數的客服聊天機器人皆是透過事先建立的資料庫，並且僅以此資料庫作為回覆的依據，往往造成回應過於制式化，無法靈活回應資料庫以外的問題，導致可能無法有效地解決顧客的問題，最終仍導向由客服專員接手處理。\n\n　　綜合上述，本研究期望基於自適應機制(Adaptive)建構一個『智慧互動聊天機器人』，主要特色在於能夠自我學習並新增回覆內容，再者可以根據使用者的回饋進行權重更新，適時因不同情況更換回覆語句，盡可能解決使用者問題與使其獲得最佳對話體驗，並且因應近年來醫療科別分類愈發精細，導致多數病患常常掛錯科別的情形發生，故本研究將以醫療領域中就診時的門診科別推薦互動聊天應用為例。\n\n　　本研究將運用網路爬蟲技術(Web Crawler)收集台中榮民總醫院的「科別對照症狀表」，從而藉由疾病與病狀相關字詞建立醫療就診詞庫，再交由具有醫療背景的專家評估，並經過建置、擴增與更新三個階段後，進而產生「階層語意回應樹」，階層語意回應樹為本研究之自適應聊天機器人之核心模型，根據使用者的問題給予最適當的回覆，同時在接收到使用者的回饋後，階層語意回應樹將不斷地進行再訓練(Retrain)，更新回覆內容的權重，以學習最佳的回覆方式，達到有效解決使用者的需求，並且在過程中給予貼近真人回覆的良好體驗。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"焦慮", 
        "partner":["黃晏綾", "黃宥欣", "謝沛璇", "莊勝傑"], 
        "year":"2022", 
        "introduction":"　　根據研究指出青春期為自殺意念與行為發生風險最常增加的時期，任何有可能會被批評的場合都是患者所害怕的，無限放大他人對自我的看法，進而引發社交恐慌，對任何事情都無法掌握，長久累積下來不僅影響生活、無法經濟獨立及喪失與他人溝通的能力之外，也容易讓人錯失很多機會，且亦使得患者變得孤獨。患者會為了避免社交恐慌，選擇逃避待在家裡或是透過酒精協助，反而會造成身體上更大的負擔，無法讓患者的情況徹底改善。\n\n　　在現實生活中，患者不願意面對現實世界中的問題，會產生心理防禦避免直接對問題之反應，不僅降低治療效果，甚至加重患者的社交恐慌，造成二度、三度傷害，若能將治療的方式虛擬化，提供擁有個人隱私的環境，放心在其中學會應對與探索各種情緒，讓患者能夠自我調整，在治療過程中不斷嘗試及突破，並且提供使用者視覺化圖表，自我檢視、從中獲得成就感，勢必能讓患者接觸到真實生活的情況時能具有較高的容忍度。\n\n　　因此，我們整理出以下目的：\n\n　　　　(1)降低加重患者病情之誘因，提供具有個人隱私的虛擬治療環境\n\n　　　　(2)使用多樣化情境，易於模擬患者畏懼的場景及情形\n\n　　　　(3)虛擬情境替代面對面治療，患者可彈性且漸進式調整治療強度\n\n　　　　(4)提供輔助診斷，有助於醫師制定應對策略，降低過多醫療成本\n\n　　綜合上述目的，本系統以虛擬實境(VR)情境治療方式(圖一)，提供患者替代面對面治療，練習多樣化之社交情境場景，透過先前問卷調查，並針對不同程度之患者設計關卡情境治療，患者也可透過多次練習查看相關數據分析，比較前後是否有達到減緩之效果。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"幫浪浪找個家", 
        "partner":["周凱文"], 
        "year":"2022", 
        "introduction":"　　台灣「流浪動物零安樂死」政策於2017年二月正式上路，成為全世界唯一一個執行的國家，隨之而來的影響是收容爆量，原本每個籠舍犬隻盡量控制在2-3隻，然而因硬體設備不足或收容空間有限而採用大籠舍飼養，像新北市八里區公立動物之家一籠內就關了10-15隻狗、而新店動物之家更高達15-20隻。在過度擁擠的空間裡，犬隻為了保護其他資源（食物、地盤），會與其他狗打鬥、互咬，導致全身傷痕累累，因此透過這個專題不但可以減輕收容所的負載還可以減少流浪動物的數量，使用者只要透過註冊功能就可以網站上發布流浪動物的資訊，不論是自己住家附近的流浪動物或是看到放養的行為都可以將動物資訊放在網站上。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"Take Eat Easy 讓吃變簡單", 
        "partner":["王景瀚", "邱定南", "張馨方"], 
        "year":"2022", 
        "introduction":"　　「Take Eat Easy 「讓吃變簡單」」主要為提供給視障者的系統，讓視障者可以享用到自己喜愛的食物，且不依靠他人的協助也能順利完成點餐的程序。本系統利用影像辨識判讀各種餐點，並透過語音傳達給視障者，希望透過此系統能提升視障者在用餐時的方便度及便利性。\n\n　　為了提供視障者一個飲食方面的友善環境，本系統設計出一個人性化的功能，視障者只要透過語音輸入喜愛的菜色，當使用菜色辨識時，辨識結果有與喜愛菜色資料庫相符的菜色名稱，便會優先輸出，讓視障者知道該間餐廳有自己喜愛的菜色。\n\n　　本系統使用React Native、Python及MySQL開發，擴充和維護現有系統架構。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"升學診斷寶", 
        "partner":["李嘉祁", "廖致翰", "黃鴻淯", "陳翰緯"], 
        "year":"2022", 
        "introduction":"　　「升學診斷寶」藉由聊天機器人獲取學生資訊，透過「分數」、「職業」、「性向」等三大面向進行分析，提供使用者能更加了解自己的錄取機率、就讀科系、適合自己的行業、目標科系的社會觀感，以降低使用者不夠了解自身符合的條件，導致錄取不理想學校的情況，並依照使用者想要的面向進行客製化分析，不僅能了解自身適合的科系，也可以嘗試往其他方向去做考量，希望藉由我們的系統能夠幫助使用者選擇自己心儀且適合的學校以及科系。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"流量密碼", 
        "partner":["楊承芳", "王子瑜", "李怡婷"], 
        "year":"2022", 
        "introduction":"　　本系統提供當週的資料特徵預測未來一週每日平均車速、平均流量值，預測方式以每五分鐘的時間窗格為一筆平均車速，最後繪製出「交通時空圖」，以利政府相關單位查看；此外，時空圖所預測的各路段平均車速將以綠色、橘色、黃色、紅色、紫色五種號誌顯示，不同顏色代表不同壅塞程度，透過該方式可以提供政府旅、疏運措施決策參考依據，以及提供各路段、時段服務水準指數，結合淺顯易懂的封地車道與開啟路肩介面，讓養護工程處可以藉由查詢本系統來決定施工時間，選擇避開易壅塞時間來縮短塞車時間。\n\n　　 除此之外，本系統會在每週日的晚間自動撈取當週的最新平均車速資料，並透過該資料進行下一週的平均車速預測，預測下一週的資料同時也會對上一週的資料進行模型的驗證，以確保本系統模型的準確率。\n\n　　流量密碼主要提供政府相關單位了解未來一週每日國道壅塞程度，以利提供旅、疏運措施決策參考；養護工程處人員也可依據道路縮減時最佳的施工時段來進行道路工程。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"食在好孕", 
        "partner":["林桓平", "詹龍傑", "徐欣怡", "楊孟翌", "湯俊璋"], 
        "year":"2023", 
        "introduction":"　　大多數的產婦會選擇到月子中心坐月子，目的是要讓身體快速恢復，有良好的精神及體力照顧新生兒，但產婦在月子中心還是會遭遇到種種挑戰。本團隊透過實際訪談於月子中心休養的產婦，發現產婦在產後前期會有許多後遺症，當身體狀況不佳時就只能待在床上，無法自由行動。而為了加速傷口癒合、體力恢復的速度，在飲食方面需要食用高蛋白質食物及中藥調理包，但在食材重複性高、菜色變化度不足的情況下，飲食對產婦來說不再是快樂的來源。若想變換菜色，卻又不知道在選擇喜愛菜色時是否能兼顧均衡營養。產婦無法自由選擇菜色，容易產生情緒低落的情形，而長期低落的情緒會增高產後憂鬱症的發生機率。\n\n　　根據文獻指出，每日攝取足夠的食物和特定的營養素，能夠有效地降低罹患產後憂鬱症的機率。例如，食用富含ω-3脂肪酸的食物，可以達到減緩憂鬱症的效果，此外，攝取含有維生素E、B1、B2、B6和B12的食物也可以穩定情緒。所以對於產婦來說如何攝取多元、多樣化的食物成為了很重要的課題。\n\n　　綜合上述，本團隊希望以客製化的餐飲，讓產婦在選擇喜愛食物的同時，攝取足夠的營養素，來避免情緒低落和預防產後憂鬱，使產婦在坐月子時能有良好的心情及足夠的體力，為未來做萬全的準備。因此本團隊期望透過「食在好孕」達到以下目的：\n\n　　　　提供產婦專屬的菜色建議，以協助她們更輕鬆地做出適合自己的飲食選擇。\n\n　　　　透過食用喜愛食物以及特定營養素，維持心情愉快，同時降低罹患憂鬱症的風險也減緩後遺症的不適。\n\n　　　　提供多樣化的菜色選擇，以滿足產婦的飲食喜好，確保她們能夠享受美味的食物，並兼顧到自己的營養需求。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-10.png"
    },
    { 
        "title":"址要你喜歡", 
        "partner":["莊淑玲", "謝翰典", "程貞蓉", "歐陽尹惟", "徐志忠"], 
        "year":"2023", 
        "introduction":"　　本團隊為想在餐飲業的創業者建立選址分析平台，以臺中地區為例，使用現有資料集，數據真實且可信，並且結合資訊技術的使用及資料視覺化的方式，幫助創業者減少選址時的不易，也能更好了解地址利弊。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"與穴共生", 
        "partner":["陳欣妤", "陳意晴", "邱郁珊", "張紘綸", "何佶恩"], 
        "year":"2023", 
        "introduction":"　　乾性角結膜炎，常稱為乾眼症，主要是因為眼部淚液分泌不足，導致眼睛乾燥、刺痛等問題，嚴重可能導致失明及角膜病變。根據健保署統計，目前國內罹患乾眼症人口，每年以10％的速度快速成長且有年輕化的趨勢，但乾眼症初期症狀不明顯，導致經常被漠視而錯失治療時機引發更嚴重的眼部問題，現階段乾眼症治療方式大多為使用局部類固醇眼用劑，雖然可以短期改善症狀，但長期使用容易罹患白內障和青光眼，因此非侵入式且容易達成舒緩的方式顯得更為重要。\n\n　　因此本系統結合跨平台的OpenCV視覺庫及Dlib深度學習方式，提出一項穴位指示的辨識系統，透過即時的穴位指示與相對應的手部按壓視訊畫面，協助使用者快速找到舒緩穴位，達到有效舒緩乾眼症狀的效果。除了穴位按壓舒緩外，本系統也根據不同的症狀推薦不同的食療藥材，協助使用者以內服的方式達到自我保養及舒緩，此外，提供國際公證的乾眼症檢測量表（OSDI）讓使用者填寫，並保存每次的診斷資料及復健紀錄，幫助工作繁忙的族群更清楚追蹤自身症狀。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"繪心醫效", 
        "partner":["林亞廷", "傅凱杰", "朱芸萱", "魏華萱", "郭俊廷"], 
        "year":"2023", 
        "introduction":"　　1.及早發現發展遲緩兒童：部分家長對於兒童的發展遲緩難以察覺，若能運用本系統透過影像辨識檢測孩童繪畫階段，將可反應出對應的身心發展狀態，使家長提前察覺到孩童的異常，及早協助兒童進行早期療育。\n\n　　2.減少醫療負擔與資源浪費：孩童遲緩的早期發現與治療將可大幅減少治療難度和醫療成本，且透過本系統收集到使用者的繪畫紀錄，將可輔助醫師診斷、減少醫療負擔，因此透過本研究將可降低日後醫療照護與家庭經濟的負擔。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    },
    { 
        "title":"預Jam未來", 
        "partner":["黃晏綾", "張馨方", "魏巧雅"], 
        "year":"2023", 
        "introduction":"　　重現性壅塞是造成高速公路延滯的主因之一，因此，本系統利用『高速公路局中區養護工程分局』提供的「派遣回報紀錄」和「事件影響交通之資料表」，根據各個時間段的資料特性，我們比較四種分類方法和九種迴歸方法的交通意外事件處理時間預測模型，最後我們選擇結果最優良的SVM搭配GBRT做為模型的預測方法。並且預測國道中非重現性壅塞事件的事件處理時間，提供中分局有價值的參考依據，制定交通管理策略，進而有效提升高速公路的交通流暢度、保障用路人安全，同時還能降低用路人在等待時，沒有預期心理，而引發不滿的情緒。", 
        "photo":"https://raw.githubusercontent.com/mantinedev/mantine/master/.demo/images/bg-9.png"
    }
]